amarildolacerda/bridge_python/clients/esp8266_dht_gas/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <WiFiUdp.h>
#include <EEPROM.h>
#include <DHT.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include "config.h"
#include "pages.h"

static const char *TAG = "esp8266-dht-gas";

static WiFiClient s_wifi;
static HTTPClient s_http;
static WiFiUDP s_udp;
static DHT *s_dht = nullptr;

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_broadcast_check = 0;
static unsigned long s_last_bridge_reconnect = 0;

static bool s_bridge_connected = false;

static float s_temperature = 0;
static float s_humidity = 0;
static int s_gas_level = 0;
static bool s_alarm = false;
static bool s_sensor_error = false;
static bool s_dht_valid = false;
static int s_battery = 100;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;

static char s_device_id[32];
static char s_device_id_temp[40];
static char s_device_id_gas[40];
static char s_device_name[48] = DEVICE_NAME;
static char s_device_name_gas[48] = DEVICE_NAME_GAS;

static char s_bridge_host[64] = BRIDGE_HOST;
static uint16_t s_bridge_port = BRIDGE_PORT;
static bool s_bridge_discovered = false;
static bool s_pending_register_state = false;

static int s_dht_pin = DHT_PIN;
static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;

static ESP8266WebServer s_server(80);

static const char *get_device_type_string(bool gas)
{
    return gas ? "gas" : "temperature";
}

#define EEPROM_NAME_ADDR 0
#define EEPROM_NAME_MAX 48

static void save_device_name(const char *name)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_NAME_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_NAME_ADDR + 1 + i, name[i]);
        if (name[i] == '\0') break;
    }
    EEPROM.write(EEPROM_NAME_ADDR + EEPROM_NAME_MAX, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool is_valid_name(const char *s)
{
    if (!s || s[0] == '\0') return false;
    for (int i = 0; s[i]; i++)
    {
        char c = s[i];
        if (c < 32 || c > 126) return false;
    }
    return true;
}

static void load_device_name(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_NAME_ADDR);
    if (marker == 0xFF)
    {
        char buf[EEPROM_NAME_MAX];
        for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_NAME_ADDR + 1 + i);
            if (buf[i] == '\0') break;
        }
        buf[EEPROM_NAME_MAX - 1] = '\0';
        if (is_valid_name(buf))
        {
            strncpy(s_device_name, buf, sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
        }
    }
    EEPROM.end();
}

static bool http_post(const char *path, const String &body)
{
    s_http.begin(s_wifi, String("http://") + s_bridge_host + ":" + s_bridge_port + path);
    s_http.addHeader("Content-Type", "application/json");
    s_http.addHeader("Connection", "close");
    s_http.setTimeout(5000);
    int code = s_http.POST(body);
    bool ok = (code == 200);
    s_bridge_connected = ok;
    if (!ok)
    {
        static unsigned long last_warn = 0;
        if (millis() - last_warn > 30000)
        {
            last_warn = millis();
            Serial.printf("[%s] POST %s -> %d\n", TAG, path, code);
        }
    }
    s_http.end();
    return ok;
}

static bool register_device(void)
{
    bool ok = true;
    // Register temperature device
    {
        String body;
        JsonDocument doc;
        doc["id"] = s_device_id_temp;
        doc["type"] = get_device_type_string(false);
        doc["name"] = s_device_name;
        doc["ip"] = WiFi.localIP().toString();
        serializeJson(doc, body);
        Serial.printf("[%s] Registering temp device: %s\n", TAG, s_device_id_temp);
        if (!http_post("/api/device/register", body))
        {
            Serial.printf("[%s] Failed to register temp device\n", TAG);
            ok = false;
        }
        else
        {
            Serial.printf("[%s] Temp device registered\n", TAG);
        }
    }
    // Register gas device
    {
        String body;
        JsonDocument doc;
        doc["id"] = s_device_id_gas;
        doc["type"] = get_device_type_string(true);
        doc["name"] = s_device_name_gas;
        doc["ip"] = WiFi.localIP().toString();
        serializeJson(doc, body);
        Serial.printf("[%s] Registering gas device: %s\n", TAG, s_device_id_gas);
        if (!http_post("/api/device/register", body))
        {
            Serial.printf("[%s] Failed to register gas device\n", TAG);
            ok = false;
        }
        else
        {
            Serial.printf("[%s] Gas device registered\n", TAG);
        }
    }
    return ok;
}

static void send_heartbeat(void)
{
    if (!s_bridge_discovered || !s_bridge_connected) return;

    s_http.begin(s_wifi, String("http://") + s_bridge_host + ":" + s_bridge_port + "/api/device/heartbeat");
    s_http.addHeader("Content-Type", "application/json");
    s_http.setTimeout(3000);
    String body = "{\"id\":\"" + String(s_device_id_temp) + "\"}";
    s_http.POST(body);
    s_http.end();

    s_http.begin(s_wifi, String("http://") + s_bridge_host + ":" + s_bridge_port + "/api/device/heartbeat");
    s_http.addHeader("Content-Type", "application/json");
    body = "{\"id\":\"" + String(s_device_id_gas) + "\"}";
    s_http.POST(body);
    s_http.end();
}

static void send_state(bool force)
{
    if (!s_bridge_discovered || !s_bridge_connected) return;

    static float last_temp = -999;
    static float last_hum = -999;
    static int last_gas = -1;
    static bool last_alarm = false;

    // Temperature state
    {
        bool changed = force || abs(s_temperature - last_temp) > STATE_SEND_THRESHOLD_TEMP
                       || abs(s_humidity - last_hum) > STATE_SEND_THRESHOLD_HUM;
        if (changed && s_dht_valid)
        {
            String body;
            JsonDocument doc;
            doc["id"] = s_device_id_temp;
            doc["temperature"] = s_temperature;
            doc["humidity"] = s_humidity;
            serializeJson(doc, body);
            if (http_post("/api/device/state", body))
            {
                last_temp = s_temperature;
                last_hum = s_humidity;
                s_last_send_ms = millis();
                Serial.printf("[%s] temp=%.1f hum=%.1f\n", TAG, s_temperature, s_humidity);
            }
        }
    }

    // Gas state
    {
        bool changed = force || s_alarm != last_alarm
                       || abs(s_gas_level - last_gas) >= STATE_SEND_THRESHOLD_GAS;
        if (changed)
        {
            String body;
            JsonDocument doc;
            doc["id"] = s_device_id_gas;
            doc["gas_level"] = s_gas_level;
            doc["alarm"] = s_alarm;
            serializeJson(doc, body);
            if (http_post("/api/device/state", body))
            {
                last_gas = s_gas_level;
                last_alarm = s_alarm;
                s_last_send_ms = millis();
                Serial.printf("[%s] gas=%d%% alarm=%s\n", TAG, s_gas_level, s_alarm ? "SIM" : "nao");
            }
        }
    }
}

