amarildolacerda/bridge_python/clients/esp8266_dht_gas/src/main.cpp
    maintain_bridge_discovery();

    unsigned long now = millis();

    if (!s_bridge_connected && s_bridge_discovered && now - s_last_bridge_reconnect > 30000)
    {
        s_last_bridge_reconnect = now;
        if (register_device())
        {
            s_last_state_update = now;
            s_pending_register_state = true;
        }
    }

    if (s_pending_register_state)
    {
        s_pending_register_state = false;
        send_state(true);
    }

    if (now - s_last_telemetry_update > TELEMETRY_INTERVAL)
    {
        s_last_telemetry_update = now;
        Serial.printf("[%s] RSSI=%d dBm  up=%lus\n", TAG, WiFi.RSSI(), (millis() - s_start_time) / 1000);
        send_heartbeat();
    }

    if (now - s_last_state_update > STATE_UPDATE_INTERVAL)
    {
        s_last_state_update = now;
        read_sensors();
        send_state(false);
    }

    static unsigned long s_last_force_send = 0;
    if (now - s_last_force_send > STATE_FORCE_INTERVAL)
    {
        s_last_force_send = now;
        send_state(true);
    }

    // LED status
    #ifdef LED_PIN
    static unsigned long last_led = 0;
    if (s_wifi_configuration_mode)
    {
        digitalWrite(LED_PIN, HIGH);
    }
    else if (WiFi.status() != WL_CONNECTED)
    {
        if (now - last_led >= LED_BLINK_WIFI_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else if (!s_bridge_discovered)
    {
        if (now - last_led >= LED_BLINK_BRIDGE_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else
    {
        digitalWrite(LED_PIN, LOW);
    }
    #endif

    // Gas alert LED
    #ifdef GAS_LED_ALERT_PIN
    if (!s_sensor_error && s_gas_level < GAS_ALERT_THRESHOLD)
    {
        digitalWrite(GAS_LED_ALERT_PIN, LOW);
    }
    else if (s_gas_level >= GAS_ALERT_THRESHOLD && s_gas_level < GAS_ALARM_THRESHOLD)
    {
        static unsigned long last_alert = 0;
        if (now - last_alert >= ALARM_BLINK_SLOW_MS)
        {
            last_alert = now;
            digitalWrite(GAS_LED_ALERT_PIN, !digitalRead(GAS_LED_ALERT_PIN));
        }
    }
    else if (s_gas_level >= GAS_ALARM_THRESHOLD)
    {
        digitalWrite(GAS_LED_ALERT_PIN, HIGH);
    }
    #endif

    // Gas alarm LED
    #ifdef GAS_LED_ALARM_PIN
    static unsigned long last_alarm_led = 0;
    if (s_gas_level >= GAS_ALARM_THRESHOLD)
    {
        if (now - last_alarm_led >= ALARM_BLINK_FAST_MS)
        {
            last_alarm_led = now;
            digitalWrite(GAS_LED_ALARM_PIN, !digitalRead(GAS_LED_ALARM_PIN));
        }
    }
    else
    {
        digitalWrite(GAS_LED_ALARM_PIN, LOW);
    }
    #endif

    delay(1);
}
